[
  {
    "position": "Desarrollador Web Full Stack",
    "date": "junio 2023 - actualidad",
    "company": "Profesional independiente",
    "description": ["Desarrollo de proyectos personales y profesionales Full Stack.", "En mis proyectos personales tomo el mando de todo el proceso de creación de la aplicación, desde dar forma a una idea, estructurar un plan de ejecución, elegir las tecnologías, hasta el proceso de desarrollo, testing y despliegue.","El último proyecto que he sacado adelante es Running Goals Tracker, una aplicación de seguimiento de objetivos de carrera, desarrollada en Angular + Firebase."],
    "technologies": [
      "React",
      "Angular",
      "TypeScript",
      "Tailwind",
      "Node.js",
      "Express.js",
      "Material UI",
      "Angular Material",
      "MongoDB",
      "Firebase"
    ]
  },
  {
    "position": "Desarrollador Web Front End",
    "date": "noviembre - diciembre 2024",
    "company": "Igrowker",
    "description": ["Como desarrollador Front End participé en la creación de Wander, una aplicación web desarrollada por un equipo multidisciplinar y multicultural. Utilizamos tecnologías como React + TypeScript, y también ayudé en la parte Back End al equipo de Node.js + Express.js.", "Esta etapa me ayudó a mejorar mis habilidades blandas: comunicación, proactividad, resolución de problemas, liderazgo, adaptación al cambio, entre otras. También me introdujo en la dinámica con un grupo de trabajo real, bajo metodologías ágiles (weekly/daily, sprints, entregables)."],
    "technologies": [
      "React",
      "TypeScript",
      "Tailwind",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Postman"
    ]
  },
  {
    "position": "Programador Java",
    "date": "marzo - junio 2023",
    "company": "Deiteco S.L.",
    "description": ["Mi responsabilidad principal era el mantenimiento y desarrollo de código en Java + Spring. Las aplicaciones que desarrollabamos tenían que ver con la transformación y adaptación de datos obtenidos de distintos tipos de hojas de cálculo, con el fin de que fuesen compatibles con otras plataformas (Sage, PrestaShop...).", "En relación a esto, también hacía mantenimiento y actualización de bases de datos para el cliente, por medio de interfaces gráficas.", "También me dediqué a maquetar contenido web para diferentes clientes, especialmente con WordPress + Divi Builder."],
    "technologies": [
      "Java",
      "Spring",
      "Divi Builder con WordPress",
      "HTML5",
      "CSS3",
      "JavaScript",
      "Sage 50",
      "PrestaShop"
    ]
  },
  {
    "position": "Desarrollador Web",
    "date": "2019 - marzo 2023",
    "company": "Profesional independiente",
    "description": ["Durante este periodo me dediqué al desarrollo de proyectos personales como desarrollador Front End.","Me formé además en tecnologías del Back End, y en la gestión de datos con bases de datos SQL y NoSQL. También adquirí conocimientos en el sistema de control de versiones de Git, y aprendí a manejar la plataforma GitHub para el trabajo colaborativo.","Además también recibí formación básica en temas relacionados con la gestión de sistemas informáticos, y en el manejo de servidores como Nginx, Apache, y el despliegue de aplicaciones con Docker."],
    "technologies": [
      "Java",
      "Spring",
      "Divi Builder con WordPress",
      "HTML5",
      "CSS3",
      "JavaScript",
      "Sage 50",
      "PrestaShop"
    ]
  },
  {
    "position": "Maquetador Web",
    "date": "2016 - 2019",
    "company": "Diócesis de Getafe (voluntario)",
    "description": ["Mi tarea principal fue el desarrollo de la antigua página web de la Delegación de Juventud de la Diócesis de Getafe. Para ello, utilicé principalmente la pila básica de desarrollo web (HTML5, CSS3 y JavaScript).","Además ayude en la creación de contenido para la web, así como en la creación de carteles y otros materiales gráficos para eventos de la Delegación, usando principalmente Adobe Illustrator y Adobe Premiere.","Otra de mis tareas fue la de gestionar varias de las redes sociales de la Delegación, como Twitter, Instagram o YouTube."],
    "technologies": [
      "HTML5",
      "CSS3",
      "JavaScript",
      "jQuery",
      "Adobe Illustrator",
      "Adobe Premiere",
      "Hoostuite"
    ]
  }
]